Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: So many browser options, but there’s only one that works best for your needs. The best browser for you should offer both speed and privacy protection.
am: በርካታ የድረ-ገፅ ማሰሻ አማራጮች አሉ፤ ነገርግን ፍላጎትዎን የሚያሟላው አንዱ ብቻ ነው። ታዲያ ይኽ ለርስዎ የተሻለው ድረ-ገፅ ማሰሻ፤ ፍጥነት እና የግላዊነት ጥበቃን ሁለቱንም አጣምሮ ሊያቀርብልዎ ይገባል።

source: Something went wrong
am: የሆነ ስህተት ተከስቷል

source: Sorry, we can’t find that page
am: ይቅርታ፣ ያንን ገጽ ማግኘት አልቻልንም

source: Sorry, we couldn’t find the download you’re looking for. Please try again, or select a download from the list below.
am: ይቅርታ፥ ለመጫን የሚፈልጉትን ነገር ማግኘት አልቻልንም። እባክዎ እንደገና ይሞክሩ ወይም የሚጭኑትን ከሚከተሉት ዝርዝሮች ይምረጡ።

source: Source code
am: የደንብ ምንጭ

source: So you’ve got a { -brand-name-chromebook } — now it’s time to get the independent, automatically private { -brand-name-firefox-browser } to protect your personal data.
am: ስለዚህ { -brand-name-chromebook } አለዎት — የግል ውሂብዎን ለመጠበቅ በራስ-ሰር የግል { -brand-name-firefox-browser }ን ለማግኘት ጊዜው አሁን ነው።

source: <span>{ -brand-name-firefox-aurora }</span> for { -brand-name-android }
am: <span>{ -brand-name-firefox-aurora }</span> ለ{ -brand-name-android }

source: <span>{ -brand-name-firefox-beta }</span> for { -brand-name-android }
am: <span>{ -brand-name-firefox-beta }</span> ለ{ -brand-name-android }

source: <span>{ -brand-name-firefox-nightly }</span> for { -brand-name-android }
am: <span>{ -brand-name-firefox-nightly }</span> ለ{ -brand-name-android }

source: <span>{ -brand-name-firefox }</span> for { -brand-name-android }
am: <span>{ -brand-name-firefox }</span> ለ{ -brand-name-android }

source: <span>{ -brand-name-firefox }</span> for { -brand-name-ios }
am: <span>{ -brand-name-firefox }</span> ለ{ -brand-name-ios }

source: Speak up
am: ተናገር

source: Speed, meet security. { -brand-name-firefox } is two times faster with 30% less memory than { -brand-name-chrome }.
am: ፍጥነት እንዲሁም ደህንነትን ያሟላ። { -brand-name-firefox } ከ{ -brand-name-chrome } በ30% ባነሰ ማህደረ ትውስታ ሁለት እጥፍ ፈጣን ነው።

source: Speed up thanks to ad blockers
am: ለማስታወቂያ ማገጃዎች ምስጋና ይግባቸው

source: Spell check
am: የፊደል አጻጻፍ

source: Start now
am: አሁን ጀምር

source: Stay private online
am: በመስመር ላይ ግላዊ ይሁኑ

source: Storage panel
am: የማጠራቀሚያ ፓነል

source: Stream, share and play
am: ይልቀቁ፣ ያጋሩ እንዲሁም ይጫወቱ

source: Success! Your default browser is set to { -brand-name-firefox }.
am: ስኬት! ነባሪ አሳሽዎ ወደ { -brand-name-firefox } ተቀናብሯል።

source: Supercharge { -brand-name-firefox } with Add-ons
am: ጭማሪዎችን በመጠቀም { -brand-name-firefox }ን ያጎልብቱ

source: Support
am: ድጋፍ

source: Supporting independent technology: since most major browsers are now running on { -brand-name-chromium }, there are fewer options that don’t feed into the Big Tech machine. { -brand-name-firefox } is backed by a not-for-profit and is dedicated to fixing the internet. Using { -brand-name-firefox } makes you a part of that.
am: ገለልተኛ ቴክኖሎጂን መደገፍ፡- አብዛኞቹ ዋና አሳሾች አሁን በ{ -brand-name-chromium } ላይ እየሰሩ ስለሆነ፣ ወደ ትልቅ ቴክኖሎጂ ማሽን ግባዓት እንዳይሆኑ ጥቂት አማራጮች አሉ። { -brand-name-firefox } ለትርፍ በማይሰራ የተደገፈ እና በይነመረብን ለመጠገን የተነደፈ ነው። { -brand-name-firefox }ን መጠቀም የዚያ አካል ያደርግዎታል።

source: Switch to Dark Mode any time to reduce eye strain and prolong your battery power.
am: የዓይን ድካምን ለመቀነስ እና የባትሪዎን ኃይል ለማራዘም በማንኛውም ጊዜ ወደ ጨለማ ሁነታ ይቀይሩ።

source: Sync across devices
am: በመሳሪያዎች ላይ አሰናስል

source: Sync your devices
am: መሳሪያዎችዎን ያሰናስሉ

source: Systems &amp; Languages
am: ስርዓቶች እና ቋንቋዎች

source: Take a bite out of cookies
am: ከኩኪዎች ትንሽ ይውሰዱ

source: Take a browse on the wild side.
am: የወደፊቱን ጊዜ የሙከራ ጉዞ ይውሰዱ።

source: Take control of your browser.
am: ማሰሻዎን እርስዎ የሚቆጣጠሩት ያድርጉት።

source: Take private mode to the next level
am: የግል ሁነታን ወደ ቀጣዩ ደረጃ ይውሰዱ

source: Take your privacy with you everywhere. { -brand-name-firefox-browsers } for { -brand-name-ios } and { -brand-name-android } have the same strong privacy settings to block trackers from following you around the web, no matter where you are.
am: ግላዊነትዎን በሁሉም ቦታ ከእርስዎ ጋር ይውሰዱት። { -brand-name-firefox-browsers } ለ{ -brand-name-ios } እና { -brand-name-android } የትም ይሁኑ የትም መከታተያዎች በድሩ ላይ እርስዎን እንዳይከተሉ ለመከላከል ተመሳሳይ ጠንካራ የግላዊነት ቅንጅቶች አሏቸው።

source: Take your stand against an industry that’s selling your data to third parties. Stay smart and safe online with technology that fights for you.
am: የርስዎን መረጃዎች ለሶስተኛ ወገን አሳልፈው በሚሸጡ ድርጅቶች ላይ አቋም ይውሰዱ። ደህንነትዎን በሚጠብቁ መሳሪያዎች በመገልገል በይነመረብ ሲጠቀሙ ንቁ እና ጠንቃቃ ይሁኑ።

source: Test about-to-be-released features in the most stable pre-release build.
am: በጣም በተረጋጋ የቅድመ-ልቀት ግንባታ ውስጥ ሊለቀቁ የሚችሉ ባህሪያትን ይሞክሩ።

source: Test beta versions of { -brand-name-firefox } for { -brand-name-ios } via { -brand-name-apple }’s { -brand-name-test-flight } program.
am: የ{ -brand-name-firefox }ን የቅድመ-ይሁንታ ስሪቶችን ለ{ -brand-name-ios } በ{ -brand-name-apple } { -brand-name-test-flight } መተግበሪያ በኩል ይሞክሩ።

source: Test beta versions of { -brand-name-firefox } for { -brand-name-ios } via { -brand-name-apple }’s { -brand-name-test-flight } program and help make our mobile browser for { -brand-name-iphone }, { -brand-name-ipad } and iPod touch even better.
am: የ{ -brand-name-firefox }ን የቅድመ-ይሁንታ ስሪቶችን ለ{ -brand-name-ios } በ{ -brand-name-apple }’s { -brand-name-test-flight } ፕሮግራም ይሞክሩ እና የስልክ አሳሻችንን ለማመቻቸት ያግዙን። { -brand-name-iphone }፣ { -brand-name-ipad } እና iPod touch በተሻለ ሁኔታ።

source: Test brand new features daily (or… nightly). Enjoy at your own risk.
am: አዳዲስ ባህርያት ይሞክሩ በየዕለቱ (ወይም ... በየምሽቱ):: በራስዎ ሀላፊነት ይደሰቱ.

source: Test your sites against soon-to-be-released { -brand-name-firefox } browser features with powerful, flexible DevTools that are on by default.
am: ድህረ-ገጾችዎን በቅርቡ በሚለቀቁ የ{ -brand-name-firefox } አሳሽ ባህሪያት በነባሪነት በሚሠሩ ኃይለኛ እና ተጣጣፊ DevTools ይፈትኗቸው።

source: Thanks for choosing { -brand-name-firefox }
am: { -brand-name-firefox }ን ስለመረጡ እናመሰግናለን

source: Thanks for using the latest { -brand-name-firefox } browser. When you choose { -brand-name-firefox }, you support a better web for you and everyone else. Now take the next step to protect yourself.
am: የቅርብ ጊዜውን { -brand-name-firefox } አሳሽ ስለተጠቀሙ እናመሰግናለን። { -brand-name-firefox }ን ሲመርጡ ለእርስዎ እና ለሌሎች ሰዎች ሁሉ የተሻለ ድርን ይደግፋሉ። አሁን እራስዎን ለመጠበቅ ቀጣዩን እርምጃ ይውሰዱ።

source: The ad blocker – a secret weapon against annoying ads.
am: የማስታወቂያ ማገጃ - የሚያበሳጩ ማስታወቂያዎችን የሚከላከል ሚስጥራዊ መሣሪያ።

source: The average person sees an average of 4,000 ads a day. If you think that’s too many, an ad blocker is your new best friend.
am: አማካይ ሰው በቀን በአማካይ 4,000 ማስታወቂያዎችን ያያል ፡፡ በጣም ብዙ እንደሆኑ ካሰቡ የማስታወቂያ ማገጃ አዲሱ የቅርብ ጓደኛዎ ነው ፡፡

source: The { -brand-name-firefox } browser is built to protect your privacy at every turn — because that’s the fastest way to free you from slow loads, bad ads, and trackers.
am: የ{ -brand-name-firefox } አሳሽ የተገነባው በእያንዳንዱ ዙር የእርስዎን ግላዊነት ለመጠበቅ ነው - ምክንያቱም ያ እርስዎን ከዘገምተኛ ጭነቶች፣ መጥፎ ማስታወቂያዎች እና መከታተያዎች የሚያላቅቁበት ፈጣኑ መንገድ ነው።

source: The browser made for developers
am: ለገንቢዎች የተሰራ አሳሽ

source: The Browser Wars
am: የአሳሽ ጦርነቶች

source: The history of web browsers
am: የድር አሳሾች ታሪክ

source: The History of Web Browsers
am: የድር አሳሾች ታሪክ

source: The intended recipient of the email must have consented.
am: የታሰበው የኢሜል ተቀባይ ፍቃደኛ መሆን አለበት።

source: The internet has become as essential as electricity and running water, so choosing the best browser for you is more important than ever. The internet is a second office, a teacher and sometimes a medical advisor, even if your actual doctor would prefer you didn’t look up your symptoms online.
am: ባሁኑ ጊዜ ኢንተርኔት እንደ መብራት እና ውሀ ሁሉ በጣም አስፈላጊ እየሆነ መጥቷል፤ ስለዚህ የተሻለ ድረ-ገፅ ማሰሻን መምረጥ ከመቼውም ጊዜ በላይ አስፈላጊ ሆኗል። ባሁኑ ጊዜ ኢንተርኔት እንደ ሁለተኛ ቢሮ፣ እንደ አስተማሪ አንዳንዴም እንደ ህክምና አማካሪ ይቆጠራል፤ ምንም እንኳን ሀኪሞች በኢንተርኔት ላይ የሚደረግ የጤንነት ምርመራን ባይደግፉትም።

source: Themes
am: ገጽታዎች

source: The pre-alpha version for power users who like to hunt crashes and test new features as they’re coded.
am: የቅድመ-አልፋ ስሪት ሰርጎ-ገቦችን አድኖ መያዝ ለሚፈልጉ በልዩ ሁኔታ የተቀረፀ ነው - ይሞክሩት።

source: There are a few ways a browser can help its users stay secure. A browser that is up to date with the latest security tech can help protect your computer and websites from unwanted visitors, such as malware or computer viruses.
am: አንድ ድረ-ገፅ ማሰሻ የደንበኞቹን ደህንነት የሚጠብቅበት ጥቂት መንገዶች አሉ። ይኼ ድረ-ገፅ ማሰሻ የደህንነት መጠበቂያ መንገዶቹን በየጊዜው የሚያዘምን ከሆነ፤ የሚጠቀሙበትን ኮምፒውተር እና ድረ-ገፅ ካላስፈላጊ ጎብኚዎች እንደ ማልዌር እና ኮምፒውተር ቫይረስ የመሳሰሉትን ይጠብቅልዎታል።

source: There’s no need to settle. Change up the new tab page, search bar, bookmarks and more to explore the internet the way you want.
am: መፍታት አያስፈልግም። በይነመረብን በሚፈልጉት መንገድ ለማሰስ አዲሱን የትር ገጽ፣ የፍለጋ አሞሌ፣ ዕልባቶች እና ሌሎችንም ይለውጡ።

source: These ads might be loud video ads, ads that follow you around the web, trackers, third-party cookies, and more. To use an ad blocker, you can search for ad blocker add-ons that are available in your browser. <a href="{ $firefox }">{ -brand-name-firefox }</a>, for example, has <a href="{ $addons }">this list of approved ad blocker add-ons</a>. Click on this list (or ad blockers that are approved for your browser) and see which fits your needs.
am: እነዚህ ማስታወቂያዎች ከፍተኛ ድምጽ ያላቸው የቪዲዮ ማስታወቂያዎች፣ እርስዎን በድር ላይ የሚከተሉ ማስታወቂያዎች፣ መከታተያዎች፣ የሶስተኛ ወገን ኩኪዎች እና ሌሎችም ሊሆኑ ይችላሉ። የማስታወቂያ ማገጃን ለመጠቀም በአሳሽዎ ውስጥ የሚገኙትን የማስታወቂያ ማገጃ ማከያዎች መፈለግ ይችላሉ። <a href="{ $firefox }">{ -brand-name-firefox }</a>፣ ለምሳሌ፣ <a href="{ $addons }">ይህ የጸደቁ የማስታወቂያ ማገጃ ተጨማሪዎች ዝርዝር አለው</a>። በዚህ ዝርዝር ላይ ጠቅ ያድርጉ (ወይም ለአሳሽዎ የተፈቀደላቸው የማስታወቂያ ማገጃዎች) እና ከፍላጎትዎ ጋር የሚስማማውን ይመልከቱ።

source: The second is not storing too much user data. Hackers can’t steal what’s not there, which is why { -brand-name-firefox } keeps a minimum amount of information about its users. <a href="{ $data }">{ -brand-name-firefox } knows</a> if you use the browser and your general location <a href="{ $privacy }">but not the name of your childhood pet or your favorite color.</a>
am: ሁለተኛው በጣም ብዙ የተጠቃሚ ውሂብ አለማከማቸት ነው። ሰርጎ ገቦች የሌለን ነገር መስረቅ አይችሉም፣ ለዚህም ነው { -brand-name-firefox } ስለተጠቃሚዎቹ አነስተኛውን መረጃ የሚይዘው። አሳሹን እና አጠቃላይ ያሉበትን አካባቢዎን ከተጠቀሙ <a href="{ $data }">{ -brand-name-firefox } ያውቃል</a> <a href="{ $privacy }">ነገር ግን የእርስዎን የልጅነት ስም፣ የቤት እንሣዎን ስም ወይም የሚወዱት ቀለምን አያጨምርም።</a>

source: The standard { -brand-name-firefox } browser — fast and private. If you’re not sure which { -brand-name-firefox } to choose, choose this.
am: መደበኛ { -brand-name-firefox } አሳሽ -- ፈጣን እና ግላዊ። የትኛውን { -brand-name-firefox } እንደሚመርጡ እርግጠኛ ካልሆኑ ይህንን ይምረጡ።

source: Third Party Cookie Blocking
am: የሶስተኛ ወገን ኩኪ ማገድ

source: This is one of the many reasons to choose the { -brand-name-firefox } browser: { -brand-name-firefox } blocks third-party trackers by default. We have other reasons and we’ll get into those later.
am: ይህ { -brand-name-firefox } አሳሹን ለመምረጥ ከብዙ ምክንያቶች አንዱ ነው፡ { -brand-name-firefox } የሶስተኛ ወገን መከታተያዎችን በነባሪ ያግዳል። ሌሎች ምክንያቶች አሉን ስለነሱ በኋላ ላይ እንገባለን።

source: Tips for filing a bug
am: የማይሠራ ነገርን ለመጠቆም የሚረዱ መንገዶች

source: Today is a different story. Ads, privacy hacks, security breaches, and fake news might have you looking at other qualities in a browser. How does the browser protect your privacy? Does it allow trackers to follow you across the web? Is it built to multitask and handle many computer and internet operations at once?
am: ዛሬ ግን የተለየ ትርክት ነው ያለው። ማስታወቂያ፣ የግለሰብ መረጃዎችን መጥለፍ፣ ማጭበርበር እና ሀሰተኛ ዜናዎች ልናተኩርባቸው የሚገቡ የአንድ ድረ-ገፅ ማሰሻ የጥራት መለኪያዎች ሆነዋል። እንዴት ነው አንድ የድረ-ገፅ ማሰሻ ደህንነትዎን ሊያስጠብቅ የሚችለው? ኢንተርኔት ሲጠቀሙ ሰርጎ-ገቦች የእርስዎን ዱካ እንዲከታተሉ ይፈቅዳል? አሠራሩ ዘርፈ-ብዙ ሥራዎችን ለመከወን፣ ባንድ ጊዜ ብዙ ኮምፒውተሮችን ለመያዝ እና የተለያዩ የኢንተርኔት አገልግሎቶችን ለመጠቀም ያስችላል ወይ?

source: Track CSS, JavaScript, security and network issues.
am: CSS፣ JavaScript፣ የደህንነት እና የአውታረ መረብ ጉዳዮችን ይከታተሉ።

source: Trackers are all those annoying “cookies” messages you get on airline sites. These third-party trackers know where you click and can be used to analyze your behavior. A private browser should give users the option to turn off third-party trackers, but ideally, turn them off by default.
am: ሠርጎ-ገቦች የሚባሉት ኢንተርኔት በምንጠቀምበት ጊዜ የሚያበሳጩ መሸጎጫ "cookies" መልዕክቶችን አስር ጊዜ የሚልኩ ድረ-ገፆች ናቸው። እነዚህ የሶስተኛ ወገን ዱካዎች ታዲያ ምን እያከናወኑ እንዳሉና አዘውትረው የሚከፍቱትን ድረ-ገፅ ያውቃሉ። ግላዊ የሆነ ድረ-ገፅ ማሰሻ ግን ይኽንን የሚከላከሉበት መንገድ በነባራዊነት አለው።

source: Tracking protection
am: የክትትል ጥበቃ

source: Translate the web
am: ድሩን ተርጉም

source: Travel the internet with protection on all your devices.
am: በሁሉም መሳሪያዎችዎ ላይ ጥበቃ በማድረግ በይነመረብን ይጓዙ።

source: Try New Features in a Pre-Release { -brand-name-android } Browser | { -brand-name-firefox }
am: በቅድመ-መለቀቅ አዲስ ባህሪያትን ይሞክሩ { -brand-name-android } አሳሽ | { -brand-name-firefox }

source: Try New Features in a Pre-Release { -brand-name-ios } Browser | { -brand-name-firefox }
am: በቅድመ-መለቀቅ አዲስ ባህሪያትን ይሞክሩ { -brand-name-ios } አሳሽ | { -brand-name-firefox }

source: Try the latest { -brand-name-android } features, before they get released to the rest of the world.
am: ለተቀረው አለም ከመለቀቃቸው በፊት የቅርብ ጊዜዎቹን የ{ -brand-name-android } ባህሪያት ይሞክሩ።

source: Tweak your settings
am: ቅንብሮችዎን ያስተካክሉ

source: Unblock bottlenecks, streamline processes, optimize assets.
am: ማነቆዎችን ይክፈቱ ፣ ሂደቶችን ያመቻቹ ፣ ንብረቶችን ያሻሽሉ።

source: Understanding privacy
am: ግላዊነትን መረዳት

source: Update your browser to fast, safe and secure { -brand-name-firefox }.
am: አሳሽዎን ወደ ፈጣን፣ አስተማማኝ እና ደህንነቱ የተጠበቀ { -brand-name-firefox } ያዘምኑ።

source: Users on 64-bit { -brand-name-windows } who download { -brand-name-firefox } can get our 64-bit version by default. That means you get a more secure version of { -brand-name-firefox }.
am: በ64-ቢት { -brand-name-windows } ላይ { -brand-name-firefox }ን የሚያወርዱ ተጠቃሚዎች የ64-ቢት ስሪታችንን በነባሪነት ማግኘት ይችላሉ። ይህ ማለት ይበልጥ ደህንነቱ የተጠበቀ የ{ -brand-name-firefox } ስሪት ያገኛሉ ማለት ነው።

source: Users on 64-bit { -brand-name-windows } who download { -brand-name-firefox } can get our 64-bit version by default. That means you get a more secure version of { -brand-name-firefox }, one that also <a href="{ $crashes }">crashes a whole lot less</a>. How much less? In our tests so far, 64-bit { -brand-name-firefox } reduced crashes by 39% on machines with 4GB of RAM or more.
am: በ64-ቢት { -brand-name-windows } ላይ { -brand-name-firefox }ን የሚያወርዱ ተጠቃሚዎች የ64-ቢት ስሪታችንን በነባሪነት ማግኘት ይችላሉ። ይህ ማለት ይበልጥ ደህንነቱ የተጠበቀ የ{ -brand-name-firefox } ስሪት ያገኛሉ፣ ይህ ደግሞ <a href="{ $crashes }">ብልሽት ማጋጠሙ በጣም ያነሰ ነው</a>። ምን ያህል ያነሰ? እስካሁን ባደረግናቸው ሙከራዎች፣ 64-ቢት { -brand-name-firefox } 4GB RAM ወይም ከዚያ በላይ ባላቸው ማሽኖች ላይ የሚደርሰውን ብልሽት በ39% ቀንሷል።

source: View
am: ዕይታ

source: Visit Support for More Details
am: ለተጨማሪ ዝርዝሮች ድጋፍን ይጎብኙ

source: Visual Editing
am: ምስላዊ አርትዖት

source: Watch the video
am: ተንቀሳቃሽ ምስሉን ይመልከቱ

source: Web Era
am: የድር ዘመን

source: We block the ad trackers. You explore the internet faster.
am: እኛ የማስታወቂያ መከታተያዎችን እናግዳለን። እርስዎ በይነመረቡን በፍጥነት ያስሱ።

source: We’re all about a healthy internet but sometimes broken URLs happen.
am: ሁላችንም ስለ ጤናማ በይነመረብ ነን ነገርግን አንዳንድ ጊዜ የተበላሹ አድራሻዎች ይከሰታሉ።

source: We visit hundreds or even thousands of websites each day, and you can’t expect users to make security and privacy decisions for each of these sites. That is why a browser that gives you more control is so important - because it offers real, meaningful protection.
am: በየቀኑ በመቶዎች ወይም በሺዎች የሚቆጠሩ ድረ-ገፆችን ልንጎበኝ እንችላለን፤ ታዲያ የእነዚህ ድረ-ገፆች ተጠቃሚዎች ሁልጊዜ ለደህንነት እና ለጥንቃቄ ትኩረት ላይሰጡ ይችላሉ። ለዛ ነው አንድ ድረ-ገፅ ማሰሻ ለእርስዎ የመቆጣጠር አቅም መስጠቱ የሚጠቅመው፤ ምክንያቱም እውነተኛ እና ትርጉም ያለው የጥንቃቄ አገልግሎት ስለሆነ ነው።

source: We wish it were more straightforward, but your { -brand-name-chromebook } would prefer to keep you in the { -brand-name-google-play } ecosystem. However, we think it’s worth the effort to install the { -brand-name-firefox } browser to your { -brand-name-chromebook } – and we’ve got resources to help you if you need them. There are two ways to get { -brand-name-firefox } on your device.
am: የበለጠ ግልጽ እንዲሆን እንመኛለን፣ ነገር ግን የእርስዎ { -brand-name-chromebook } እርስዎን በ{ -brand-name-google-play } ስነ-ምህዳር ውስጥ ቢያስቀምጡ ይመርጣል። ነገር ግን፣ { -brand-name-firefox } አሳሹን ወደ እርስዎ { -brand-name-chromebook } መጫን ጥረቱ ጠቃሚ ነው ብለን እናስባለን - እና ከፈለጉ እርስዎን የሚረዱ ግብዓቶች አሉን። በመሳሪያዎ ላይ { -brand-name-firefox }ን ለማግኘት ሁለት መንገዶች አሉ።

source: We worry about your data safety so you don’t have to.
am: እርስዎ ሊጨነቁ አይገባም ለውሂብዎ ደህንነት እንጨነቃለን።

source: What is a web browser?
am: የድር አሳሽ ምንድን ነው?

source: What is { -brand-name-firefox }?
am: { -brand-name-firefox } ምንድን ነው?

source: What is fingerprinting?
am: የጣት አሻራ ምንድን ነው?

source: What’s the difference between 32-bit and 64-bit?
am: በ32-ቢት እና 64-ቢት መካከል ያለው ልዩነት ምንድነው?

source: When you go to a website and the page remembers your username and password – that’s made possible by a cookie.
am: ወደ አንድ ድረ-ገፅ ሲሄዱ እና ገጹ የተጠቃሚ ስምዎን እና የይለፍ ቃልዎን ሲያስታውስ - ይህ ሊሆን የቻለው በኩኪ ነው።

source: When you use a browser for everything, it needs to be fast. But for the same reason, it needs to be private. A browser has access to everything you do online, so it can put you at real risk if it doesn’t have strong privacy features.
am: አንድን ድረ-ገፅ ማሰሻ ለማንኛውም ተግባር ሲጠቀሙ፤ ፈጣን መሆን ይገባዋል። እንደዚሁም ደህንነቱ የተጠበቀ መሆን አለበት። የድረ-ገፅ ማሰሻ ማንኛውንም ነገር ከኢንተርኔት ላይ ማግኘት ያስችለናል፤ ስለዚህ ጠንካራ የደህንነት መጠበቂያ ዘዴዎች ከሌሉት ለከፍተኛ ጥቃት ሊያጋልጥ ይችላል።

source: While a { -brand-name-chromebook } already has { -brand-name-chrome } installed, downloading and using { -brand-name-firefox } as your go-to browser provides you with a few benefits:
am: አንድ { -brand-name-chromebook } አስቀድሞ { -brand-name-chrome } ከጫነ፣ { -brand-name-firefox }ን ማውረዱ እና መጠቀሙ እንደ ወደ-ሂድ አሳሽ ጥቂት ጥቅሞችን ይሰጥዎታል።

source: While a { -brand-name-chromebook } already has Chrome installed, downloading and using { -brand-name-firefox } as your go-to browser provides you with a few benefits
am: የ{ -brand-name-chromebook } አስቀድሞ { -brand-name-chrome } ተጭኖ እያለ { -brand-name-firefox }ን አውርደው እና ዋና አሳሽዎ አድርገው መጠቀም ጥቂት ጥቅሞችን ይሰጥዎታል

source: Who owns { -brand-name-firefox }?
am: የ{ -brand-name-firefox } ባለቤት ማነው?

source: Why get <span>{ -brand-name-firefox }</span> for { -brand-name-chromebook }?
am: ለምን <span>{ -brand-name-firefox }</span>ን ለ{ -brand-name-chromebook } አገኙት?

source: Windows installers for corporate IT that simplify the configuration, deployment and management of the { -brand-name-firefox-browser }.
am: የ{ -brand-name-firefox-browser }ን ውቅር፣ ማሰማራት እና ማስተዳደርን የሚያቃልል ዊንዶውስ ጫኚዎች ለድርጅቶች IT።

source: Works with { -brand-name-google } products
am: ከ{ -brand-name-google } ምርቶች ጋር ይሰራል

source: *x86 based { -brand-name-chromebook } running { -brand-name-chromeos } 80 or later
am: * x86 ላይ የተመሰረተ { -brand-name-chromebook } { -brand-name-chromeos } 80 ወይም ከዚያ በሁዋላ እያሄደ ነው

source: You can also try refreshing this page or go to <a href={ $firefox }>firefox.com</a> or <a href={ $mozilla }>mozilla.org</a>
am: እንዲሁም ይህን ገጽ ለማደስ መሞከር ወይም ወደ <a href={ $firefox }>firefox.com</a> ወይም <a href={ $mozilla }>mozilla.org</a> መሄድ ይችላሉ።

source: Your browsing history is history
am: የአሰሳ ታሪክዎ ታሪክ ነው

source: Your download link was sent.
am: የማውረድ አገናኝዎ ተልኳል።

source: Your download should begin automatically. Didn’t work? <a id="{ $id }" href="{ $fallback_url }">Try downloading again</a>.
am: ማውረድዎ በራስ-ሰር መጀመር አለበት። አልሰራም? <a id="{ $id }" href="{ $fallback_url }">እንደገና ለማውረድ ይሞክሩ</a>።

source: Your download should begin automatically. Didn’t work? <a id="{ $id }" href="{ $fallback_url }">Try downloading again.</a>
am: ማውረድዎ በራስ-ሰር መጀመር አለበት። አልሰራም? <a id="{ $id }" href="{ $fallback_url }">እንደገና ለማውረድ ይሞክሩ።</a>

source: Your download was interrupted. But all is not lost.
am: ማውረድዎ ታጉሏል። ግን ሁሉም ነገር አልጠፋም።

source: You’re all set.
am: ዝግጁ ነዎት።

source: You’re almost done. Just change your default browser to { -brand-name-firefox } in the settings panel on your screen.
am: ሊጨርሱ ነው። ልክ በማያ ገጽዎ ላይ ባለው የቅንብሮች ፓነል ውስጥ ነባሪ አሳሽዎን ወደ { -brand-name-firefox } ይለውጡ።

source: Your life, your business. { -brand-name-firefox } blocks third-party tracking cookies on { -brand-name-linux }.
am: ሕይወትዎ ፣ የእርስዎ ጉዳይ ። { -brand-name-firefox } በ{ -brand-name-linux } ላይ የሶስተኛ ወገን መከታተያ ኩኪዎችን ያግዳል።

source: Your privacy comes first
am: የእርስዎ ግላዊነት ይቀድማል

source: Your system may not meet the requirements for { -brand-name-firefox }, but you can try one of <a href="{ $url }">these versions</a>.
am: የእርስዎ ስርዓት የ{ -brand-name-firefox } መስፈርቶችን ላያሟላ ይችላል፣ነገር ግን ከ<a href="{ $url }">እነዚህ ስሪቶች</a> አንዱን መሞከር ይችላሉ።

source: Your system may not meet the requirements for { -brand-name-firefox }, but you can try one of these versions:
am: የእርስዎ ስርዓት ለ{ -brand-name-firefox } መስፈርቶችን ላያሟላ ይችላል፣ነገር ግን ከእነዚህ ስሪቶች ውስጥ አንዱን መሞከር ይችላሉ፡-

source: You should get a say in how you browse
am: እንዴት እንደሚያስሱ የመወሰን ዕድል ማግኘት አለብዎት

source: 1 add-on
am: 1 ተጨማሪ

source: %1$d new permissions are required
am: %1$d አዲስ ፈቃዶች ያስፈልጋሉ

source: %1$d out of %2$d
am: %1$d ከ%2$d

source: %1$d selected
am: %1$d ተመርጧል

source: 1 extension
am: 1 ቅጥያ

source: 1. Go to Android Settings
am: 1. ወደ አንድሮይድ መቼቶች ይሂዱ

source: 1 open tab. Tap to switch tabs.
am: 1 ትር ክፈት። ትሮችን ለመቀየር መታ ያድርጉ።

source: %1$s, %2$d of %3$d
am: %1$s፣ %2$d ከ%3$d

source: %1$s / %2$s • %3$s left
am: %1$s / %2$s • %3$s ይቀራል

source: %1$s / %2$s • in %3$s.
am: %1$s / %2$s • በ%3$s ውስጥ።

source: %1$s / %2$s • paused
am: %1$s / %2$s • ባለበት ቆሟል

source: %1$s / %2$s • pending
am: %1$s / %2$s • በመጠባበቅ ላይ

source: %1$s add-ons
am: %1$s ተጨማሪዎች

source: %1$s already exists.
am: %1$s አስቀድሞ አለ።

source: %1$s automatically stops companies from secretly following you around the web.
am: %1$s ኩባንያዎች በድር ላይ በድብቅ እንዳይከተሉዎ በራስ ሰር ያቆማል።

source: %1$s automatically tries to reject cookie requests on cookie banners.
am: %1$s በኩኪ ሰንደቆች ላይ የኩኪ ጥያቄዎችን በራስ-ሰር ውድቅ ለማድረግ ይሞክራል።

source: %1$s can automatically reject many cookie banner requests.
am: %1$s ብዙ የኩኪ ባነር ጥያቄዎችን በራስ ሰር ውድቅ ያደርጋል።

source: %1$s can close tabs you haven’t viewed over the past month.
am: %1$s ባለፈው ወር ያላየሃቸውን ትሮችን መዝጋት ይችላል።

source: %1$s can’t automatically reject cookie requests on this site. You can send a request to support this site in the future.
am: %1$s በዚህ ጣቢያ ላይ የኩኪ ጥያቄዎችን በራስ ሰር ውድቅ ማድረግ አይችልም። ለወደፊቱ ይህንን ጣቢያ ለመደገፍ ጥያቄ መላክ ይችላሉ።

source: %1$s can’t download this file type
am: %1$s ይህን የፋይል አይነት ማውረድ አይችልም

source: %1$s can try to automatically reject cookie requests.
am: %1$s የኩኪ ጥያቄዎችን በራስ ሰር ውድቅ ለማድረግ መሞከር ይችላል።

source: %1$s can try to automatically reject cookie requests. If a reject option isn’t available, %2$s may accept all cookies to dismiss the banner.
am: %1$s የኩኪ ጥያቄዎችን በራስ ሰር ውድቅ ለማድረግ መሞከር ይችላል። ውድቅ የማድረግ አማራጭ ከሌለ %2$s ሰሌዳውን ለማሰናበት ሁሉንም ኩኪዎች ሊቀበል ይችላል።

source: %1$s clears your search and browsing history from private tabs when you close them or quit the app. While this doesn’t make you anonymous to websites or your internet service provider, it makes it easier to keep what you do online private from anyone else who uses this device.
am: %1$s ሲዘጉ ወይም መተግበሪያውን ሲያቆሙ የፍለጋ እና የአሰሳ ታሪክዎን ከግል ትሮች ያጸዳል። ይህ እርስዎን ለድር ጣቢያዎች ወይም የበይነመረብ አገልግሎት አቅራቢዎ ስም-አልባ ባያደርግም፣ በመስመር ላይ የሚያደርጉትን ይህን መሳሪያ ከሚጠቀም ከማንኛውም ሰው የግል ማድረግን ቀላል ያደርገዋል።

source: %1$s completed
am: %1$s ተጠናቅቋል

source: %1$s could not be installed because it can only be installed by an organization using enterprise policies, which isn‘t supported on this platform.
am: %1$s መጫን አልተቻለም ምክንያቱም የድርጅት ፖሊሲዎችን በመጠቀም በድርጅት ብቻ ስለሚጫን፤ ይህም በዚህ መድረክ ላይ የማይደገፍ ነው።

source: %1$s could not be installed because it has a high risk of causing stability or security problems
am: %1$s መረጋጋትን ወይም የደህንነት ችግሮችን የመፍጠር ዕድሉ ከፍተኛ ስለሆነ ሊጫን አልቻለም

source: %1$s could not be installed because it has a high risk of causing stability or security problems.
am: %1$s መረጋጋትን ወይም የደህንነት ችግሮችን የመፍጠር ዕድሉ ከፍተኛ ስለሆነ ሊጫን አልቻለም።

source: %1$s could not be installed because it is not compatible with %2$s %3$s.
am: %1$s ከ%2$s %3$s ጋር ተኳሃኝ ስላልሆነ ሊጫን አልቻለም።

source: %1$s could not be verified as secure and has been disabled.
am: %1$s ደህንነቱ የተጠበቀ እንደሆነ ሊረጋገጥ አልቻለም እና ተሰናክሏል።

source: %1$s could not verify the authenticity of the application. Do you want to proceed with autofilling the selected credentials?
am: %1$s የመተግበሪያውን ትክክለኛነት ማረጋገጥ አልቻለም። የተመረጡትን ምስክርነቶች በራስ-ሙላ መቀጠል ይፈልጋሉ?

source: %1$s decides when to use secure DNS to protect your privacy.
am: %1$s የእርስዎን ግላዊነት ለመጠበቅ ደህንነቱ የተጠበቀ DNS እንዲጠቀሙ ይወስናል።
